(function(t) {
        function e(e) {
            for (var n, r, i = e[0], c = e[1], l = e[2], p = 0, d = []; p < i.length; p++)
                r = i[p],
                s[r] && d.push(s[r][0]),
                    s[r] = 0;
            for (n in c)
                Object.prototype.hasOwnProperty.call(c, n) && (t[n] = c[n]);
            u && u(e);
            while (d.length)
                d.shift()();
            return o.push.apply(o, l || []),
                a()
        }
        function a() {
            for (var t, e = 0; e < o.length; e++) {
                for (var a = o[e], n = !0, i = 1; i < a.length; i++) {
                    var c = a[i];
                    0 !== s[c] && (n = !1)
                }
                n && (o.splice(e--, 1),
                    t = r(r.s = a[0]))
            }
            return t
        }
        var n = {}
            , s = {
            app: 0
        }
            , o = [];
        function r(e) {
            if (n[e])
                return n[e].exports;
            var a = n[e] = {
                i: e,
                l: !1,
                exports: {}
            };
            return t[e].call(a.exports, a, a.exports, r),
                a.l = !0,
                a.exports
        }
        r.m = t,
            r.c = n,
            r.d = function(t, e, a) {
                r.o(t, e) || Object.defineProperty(t, e, {
                    enumerable: !0,
                    get: a
                })
            }
            ,
            r.r = function(t) {
                "undefined" !== typeof Symbol && Symbol.toStringTag && Object.defineProperty(t, Symbol.toStringTag, {
                    value: "Module"
                }),
                    Object.defineProperty(t, "__esModule", {
                        value: !0
                    })
            }
            ,
            r.t = function(t, e) {
                if (1 & e && (t = r(t)),
                8 & e)
                    return t;
                if (4 & e && "object" === typeof t && t && t.__esModule)
                    return t;
                var a = Object.create(null);
                if (r.r(a),
                    Object.defineProperty(a, "default", {
                        enumerable: !0,
                        value: t
                    }),
                2 & e && "string" != typeof t)
                    for (var n in t)
                        r.d(a, n, function(e) {
                            return t[e]
                        }
                            .bind(null, n));
                return a
            }
            ,
            r.n = function(t) {
                var e = t && t.__esModule ? function() {
                            return t["default"]
                        }
                        : function() {
                            return t
                        }
                ;
                return r.d(e, "a", e),
                    e
            }
            ,
            r.o = function(t, e) {
                return Object.prototype.hasOwnProperty.call(t, e)
            }
            ,
            r.p = "/";
        var i = window["webpackJsonp"] = window["webpackJsonp"] || []
            , c = i.push.bind(i);
        i.push = e,
            i = i.slice();
        for (var l = 0; l < i.length; l++)
            e(i[l]);
        var u = c;
        o.push([0, "chunk-vendors"]),
            a()
    }
)({
    0: function(t, e, a) {
        t.exports = a("56d7")
    },
    "00de": function(t, e, a) {},
    "0ff1": function(t, e, a) {},
    2450: function(t, e, a) {
        "use strict";
        var n = a("3643")
            , s = a.n(n);
        s.a
    },
    "2a51": function(t, e, a) {},
    "35bd": function(t, e, a) {},
    3643: function(t, e, a) {},
    "3fce": function(t, e, a) {},
    "4ee2": function(t, e, a) {},
    "56d7": function(t, e, a) {
        "use strict";
        a.r(e);
        a("cadf"),
            a("551c"),
            a("f751"),
            a("097d");
        var n = a("2b0e")
            , s = function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("div", {
                attrs: {
                    id: "app"
                }
            }, [a("router-view")], 1)
        }
            , o = []
            , r = (a("4917"),
            {
                name: "app",
                mounted: function() {
                    navigator.userAgent.match(/(phone|pad|pod|iPhone|iPod|ios|iPad|Android|Mobile|BlackBerry|IEMobile|MQQBrowser|JUC|Fennec|wOSBrowser|BrowserNG|WebOS|Symbian|Windows Phone)/i) && this.$router.push({
                        path: "/wap"
                    })
                }
            })
            , i = r
            , c = (a("6e02"),
            a("2877"))
            , l = Object(c["a"])(i, s, o, !1, null, "995c8432", null)
            , u = l.exports
            , p = a("8c4f")
            , d = function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("div", {
                attrs: {
                    id: "clause"
                }
            }, [a("div", {
                staticClass: "bar"
            }, [a("y-d-tab-bar")], 1), a("div", {
                staticClass: "container"
            }, [a("div", {
                staticClass: "tab"
            }, [a("el-cascader-panel", {
                attrs: {
                    options: t.options
                },
                model: {
                    value: t.clause,
                    callback: function(e) {
                        t.clause = e
                    },
                    expression: "clause"
                }
            })], 1), a("div", {
                staticClass: "clause_content"
            }, [a("clause-container", {
                attrs: {
                    clause: t.clause
                }
            })], 1)]), a("footer", [a("y-d-f-y-footer-bar")], 1)])
        }
            , h = []
            , m = function() {
            var t = this
                , e = t.$createElement;
            t._self._c;
            return t._m(0)
        }
            , f = [function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("div", {
                attrs: {
                    id: "tabBar"
                }
            }, [a("div", {
                staticClass: "bar"
            }, [a("div", {
                staticClass: "logo"
            }, [a("a", {
                attrs: {
                    href: "https://dict.youdao.com/?keyfrom=dict2.index"
                }
            }, [a("img", {
                attrs: {
                    src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/YDlogo.png",
                    alt: "",
                    srcset: ""
                }
            })]), a("h5", [t._v("有道服务条款")])]), a("div", {
                staticClass: "other_products"
            }, [a("a", {
                attrs: {
                    href: "https://www.youdao.com/?keyfrom=fanyi-new.copyright",
                    target: "_blank"
                }
            }, [t._v("有道首页")]), a("a", {
                attrs: {
                    href: "http://shared.youdao.com/www/about.html?keyfrom=dict2.index",
                    target: "_blank"
                }
            }, [t._v("更多产品")])])])])
        }
        ]
            , g = {
            name: "TabBar",
            props: {
                msg: String
            }
        }
            , v = g
            , _ = (a("6b4f"),
            Object(c["a"])(v, m, f, !1, null, "7ffdf8e9", null))
            , w = _.exports
            , b = function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("div", {
                attrs: {
                    id: "footerBar"
                }
            }, [a("div", {
                staticClass: "footer_products"
            }, t._l(t.productLists, function(e, n) {
                return a("a", {
                    key: n,
                    attrs: {
                        href: e.href
                    }
                }, [t._v(t._s(e.text))])
            }), 0), a("p", {
                staticClass: "footer_version"
            }, [t._v("©" + t._s(t.year) + "网易公司 "), a("router-link", {
                attrs: {
                    tag: "a",
                    to: {
                        path: "/clause",
                        query: {
                            clause: "policy"
                        }
                    }
                }
            }, [t._v("隐私条款 ")]), a("router-link", {
                attrs: {
                    tag: "a",
                    to: {
                        path: "/clause",
                        query: {
                            clause: "search"
                        }
                    }
                }
            }, [t._v("服务条款 ")]), t._v(" 京ICP证080268号 京公网安备 11010802020092号")], 1)])
        }
            , y = []
            , C = {
            name: "TabBar",
            data: function() {
                return {
                    year: (new Date).getFullYear(),
                    productLists: [{
                        text: "有道首页",
                        href: "https://www.youdao.com/?keyfrom=fanyi-new.copyright"
                    }, {
                        text: "有道词典",
                        href: "https://cidian.youdao.com/mobile.html"
                    }, {
                        text: "有道智选",
                        href: "https://dsp.youdao.com/?keyfrom=about.youdao#/index"
                    }, {
                        text: "有道智云",
                        href: "https://ai.youdao.com/?keyfrom=dict2.index"
                    }, {
                        text: "关于有道",
                        href: "https://shared.ydstatic.com/www/about.html?keyfrom=dict2.index"
                    }, {
                        text: "官方博客",
                        href: "https://i.youdao.com/"
                    }]
                }
            }
        }
            , O = C
            , T = (a("6a6d"),
            Object(c["a"])(O, b, y, !1, null, "345e83aa", null))
            , S = T.exports
            , k = function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("div", {
                attrs: {
                    id: "clauseContainer"
                }
            }, [a("h5", [t._v(t._s(t.data.title))]), "" !== t.data.desc ? a("p", {
                staticClass: "desc",
                domProps: {
                    innerHTML: t._s(t.data.desc)
                }
            }) : t._e(), "" !== t.data.content ? a("ul", {
                staticClass: "content_list"
            }, t._l(t.data.content, function(e, n) {
                return a("li", {
                    key: n,
                    staticClass: "content"
                }, [a("p", [a("span", {
                    domProps: {
                        innerHTML: t._s(e)
                    }
                })])])
            }), 0) : t._e(), a("ul", [t._l(t.data.list, function(e, n) {
                return "search" === t.type ? a("li", {
                    key: n,
                    staticClass: "search"
                }, [a("p", {
                    domProps: {
                        innerHTML: t._s(e)
                    }
                })]) : t._e()
            }), t._l(t.data.list, function(e, n) {
                return "policy" === t.type ? a("li", {
                    key: n,
                    staticClass: "policy"
                }, [a("h4", [t._v(t._s(e.title))]), void 0 != e.desc && "" != e.desc ? a("p", {
                    staticClass: "clause_desc",
                    domProps: {
                        innerHTML: t._s(e.desc)
                    }
                }) : t._e(), t._l(e.options, function(n, s) {
                    return void 0 != e.options && "" != e.options ? a("div", {
                        key: s,
                        staticClass: "clause_options"
                    }, [a("p", {
                        domProps: {
                            innerHTML: t._s(n)
                        }
                    })]) : t._e()
                })], 2) : t._e()
            }), t._l(t.data.list, function(e, n) {
                return "statement" === t.type ? a("li", {
                    key: n,
                    staticClass: "statement"
                }, [a("p", {
                    domProps: {
                        innerHTML: t._s(e)
                    }
                })]) : t._e()
            })], 2)])
        }
            , I = []
            , L = {
            search: {
                title: "网易有道词典服务条款",
                desc: "网易有道词典的所有权和运作权归有道公司所有。有道公司（以下称“有道公司”或“有道”）同意按照《网易有道词典服务条款》(下简称：“本服务条款”)规定以及不时发布的操作规则等提供基于互联网的相关服务。请用户（以下称“用户”或“您”）仔细阅读本服务条款（<span>特别是加粗部分</span>），未成年人应在法定监护人陪同下阅读。除非您已接受本服务条款，否则您无权使用本条款下的相关服务。您的使用行为将视为统一接受本服务各项条款，包括有道公司对该服务条款随时所做的任何修改。",
                content: "",
                list: ["1、有道公司运用自己的操作系统通过国际互联网络为用户提供网易有道词典服务。用户必须：", "（1）认真阅读并知晓网易有道词典的产品介绍，遵守本服务条款和相关操作规则；", "（2）提供设备，包括个人电脑一台、连接网络设备；", "（3）个人上网和支付与此服务有关的费用。", "（4）遵守中华人民共和国相关法律法规（如果用户是中华人民共和国境外的使用者，还应遵守所属国家或地区的法律法规）。", "2、软件自动升级功能", "除非用户主动选择不使用网易有道词典的自动升级功能，否则视为同意启动网易有道词典默认的自动升级功能。", "3、服务质量监测", "<span>为了监测网易有道词典的服务质量，网易有道词典在适当的时候会把软件运行时与服务质量有关的数据（包括但不仅限于查询延迟、有道公司提供服务的服务器地址等）发送到有道公司服务器。同时网易有道词典将产生一个唯一编号，当您安装或升级网易有道词典时，此编号和表示安装升级是否成功的消息将会发送到有道公司服务器。若有道公司有需要，用户有义务提供网易有道词典在用户部署时的各种安装及运行环境，包括但不限于IP地址、操作系统、网络环境。</span>这是为了改善网易有道词典的服务质量，有道公司保证不会把这些信息用作违法或不道德的用途。", "4、注册与登录", "您可以通过注册与登录网易邮箱账号或第三方平台账号获得更深入的网易有道词典服务。", "<span>用户在注册和使用账号时承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，不得在账号注册资料中出现违法和不良信息，且用户保证其在注册和使用账号时，不得有以下情形：</span>", "<span>（1）违反宪法或法律法规规定的；</span>", "<span>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</span>", "<span>（3）损害国家荣誉和利益的，损害公共利益的；</span>", "<span>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</span>", "<span>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</span>", "<span>（6）散布谣言，扰乱社会秩序，破坏社会稳定的</span>", "<span>（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</span>", "<span>（8）侮辱或者诽谤他人，侵害他人合法权益的；</span>", "<span>（9）含有法律、行政法规禁止的其他内容的。</span>", "根据相关法律、法规规定以及考虑到有道产品服务的重要性，用户同意：", "<span>（1）在注册账号时提交有效准确的个人信息进行实名认证；</span>", "<span>（2）提供及时、详尽及准确的账户注册资料；</span>", "<span>（3）用户不得以营利、任何不正当手段或以违反诚实信用原则等为自己或他人开通本服务；</span>", "<span>（4）用户对其自身帐号中的所有行为和事件负全责，不得售卖、转借账号。</span>", "<span>（5）用户应当负责妥善且正确的保管、使用、维护其申请取得的账号及账号密码，并应对其账号密码采取必要和有效的保密措施。如果用户未保管好自己的帐号和密码而对其自己、有道公司或第三方造成的损害，有道公司无需承担与此有关的任何责任。</span>", "<span>（6）若用户提供给账号注册资料不准确，不真实，含有违法或不良信息的，有道公司有权不予注册，并保留终止用户使用有道各项服务的权利。</span>", "<span>用户充分了解并同意，您必须为自己注册帐号下的一切行为负责，包括但不限于您所发表的任何内容以及由此产生的任何后果。您应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。</span>", "5、用户使用", "<span>网易有道词典仅供用户用于非商业用途。不得销售、转让、许可或以其它方式提供给任何第三方，如果要销售、转让或许可或以其它方式提供给网易有道词典或者与网易有道词典有关或派生的任何资料、服务或软件，则必须得到有道公司的书面允许。如果用户对网易有道词典有任何意见，或有如何改进的建议，可向有道公司提出。请注意，如果这样做，还会授予有道公司和第三方在网易有道词典（或第三方软件）中无偿使用和加入用户的建议或意见的权利。有道公司保留在网易有道词典中投放商业性广告的权利。</span>", "6、知识产权", "<span>（1）用户承认有道公司拥有对网易有道词典的所有权利，包括但不限于所有知识产权。“知识产权”指在专利法、著作权法、商标法、反不正当竞争法等法中规定的所有权利以及其中的所有应用、更新、扩展和恢复，无论在现在还是以后在全球范围内实施和生效。用户同意不会修改、改编、翻译网易有道词典、创作网易有道词典的派生作品、通过反编译、反向工程、反汇编或其它方式从网易有道词典得到源代码或所有数据。用户同意不会删除、掩盖或更改有道公司或任何第三方的版权声明、商标或其它知识产权声明。有道公司提供的网络服务中包含的标识、版面设计、排版方式、文本、图片、图形等均受著作权、商标权及其它法律保护，未经相关权利人同意，上述内容均不得在任何平台被直接或间接发布、使用、出于发布或使用目的的改写或再发行，或被用于其他任何商业目的。</span>", "<span>（2）本服务可能内含让用户分享词语释义、例句等用户原创内容。有道公司尊重和鼓励用户创作的内容。用户在网易有道词典上发表的全部原创内容（包括但不仅限于词语释义、例句、回答、文章和评论），著作权均归用户本人所有。用户可授权第三方以任何方式使用，不需要得到有道公司的同意。</span>", "<span>（3）为了促进知识的分享和传播，用户将其在网易有道词典上发表的全部内容，授予有道公司免费的、不可撤销的、非独家使用许可，网易有道词典有权将该内容用于有道公司各种形态的产品和服务上，包括但不限于网站以及发表的应用或有道公司的其他互联网产品。</span>", "<span>（4）第三方若出于非商业目的，将用户在有道上发表的内容转载在网易有道词典之外的地方，应当在显著位置注明原作者姓名（或原作者在网易有道词典上使用的帐号名称），并标识出原始链接，注明「发表于网易有道词典」，并不得对作品进行修改。若需要对作品进行修改，或用于商业目的，第三方应当联系用户获得单独授权，按照用户规定的方式使用该内容。</span>", "<span>（5）如果任何第三方侵犯了有道公司用户相关的权利，用户同意授权有道或其指定的代理人代表有道公司自身或用户对该第三方提出警告、投诉、发起行政执法、诉讼、进行上诉，或谈判和解，并且用户同意在有道公司认为必要的情况下参与共同维权。</span>", "<span>（6）有道公司有权对用户发布的内容进行审核，但对用户发表的任何内容均不承担任何明示或默示的保证，均不代表有道公司观点或意见。有道公司有权根据相关证据结合《侵权责任法》、《信息网络传播权保护条例》等法律法规及本服务条款的规定对侵权信息进行处理。</span>", "7、用户隐私制度", '<span>尊重用户隐私是有道公司的一项基本政策。有道公司将按照有道词典网站上公布的隐私政策（<a href="http://fanyi.youdao.com/webTransPc/index.html/#/clause?clause=policy">http://webtrans.yodao.com/webTransPc/index.html/#/clause?clause=policy</a>） 收集、存储、使用、披露和保护您的个人信息。请您完整阅读上述隐私权政策，以帮助您更好地保护您的个人信息。<span>', "8、服务变更", "<span>有道公司保留随时变更、中断或终止服务而不需通知用户的权利。用户接受有道公司行使变更、中断或终止服务的权利，有道公司不需对用户或第三方负责。</span>", "9、不可抗力条款", "<span>有道公司对不可抗力导致的损失不承担责任。本服务条款所指不可抗力包括：天灾、法律法规或政府指令的变更，因网络服务特性而特有的原因，例如境内外基础电信运营商的故障、计算机或互联网相关技术缺陷、互联网覆盖范围限制、计算机病毒、黑客攻击等因素，及其他合法范围内的不能预见、不能避免并不能克服的客观情况。</span>", "10、通知", "<span>所有发给用户的通知都可通过用户电子邮件、站内通知或在网站显著位置公告的方式进行传送。</span>有道公司将通过上述方法之一将消息传递给用户，告知其服务条款的修改、服务变更、或其它重要事情。同时，有道公司保留在网易有道词典中投放商业性广告的权利以及利用用户登录的网易邮箱发布商业性广告的权利，包括但不限于在网站登录页面及登录后任何页面内放置商业广告、向用户发送商业性广告邮件以及在用户发出的电子邮件内附上商业性广告及／或广告链接等形式，但用户有权在邮箱内的广告邮件内选择拒绝接受此类广告等信息。", "11、违约责任", "<span>若用户的行为违反了国家法律法规的规定、本服务条款的约定或者违反网易有道词典网站上的规则，有道公司有权视用户的行为性质，对用户采取包括但不限于暂停或终止部分或全部本服务，限制、中止或终止用户账号的登录和使用、追究法律责任等措施，有道也无需向用户退还支付的任何费用。用户若有违反本服务条款任何行为，导致任何第三方损害的，用户应当独立承担责任；有道公司因此遭受损失的，用户也应当一并赔偿。用户同意保障和维护有道公司的利益，负责支付由用户违反本服务条款和/或其他服务条款引起的律师费用、损害补偿费用、政府机关处罚费用和其它侵权赔偿费用等。</span>", "12、法律", "<span>如果出现纠纷，双方协商一致解决；如果双方无法通过协商解决争端，则双方同意由中国国际经济贸易仲裁委员会（简称“CIETAC”）根据CIETAC有效的仲裁规则以及适用法律在中国北京进行仲裁，并由3名仲裁员进行审理。<span>", "上述条款是各方针对本文主题的全部协议，优先于并取代所有以前或同期对此类主题的书面或口头的规定或协议。对上述任何条款的排除必须采取书面形式，并得到有道公司和/或网易有道词典一同提供或通过网易有道词典提供其软件的第三方书面签字，才能生效。", '<span>如用户对本服务条款内容有任何疑问，可发邮件（<i>feedback@corp.youdao.com</i>）或登陆网易有道词典FAQ(<<a href="https://cidian.youdao.com/faq2.html">https://cidian.youdao.com/faq2.html</a>>)获取相关信息。</span>', "<span>13.用户只有无条件接受本服务条款，才能继续使用本服务。有道公司对本服务条款享有最终解释权。</span>"]
            },
            policy: {
                title: "有道词典隐私政策",
                desc: "欢迎使用“有道词典”提供的产品和服务！有道词典（或简称“我们”）深知个人信息对您的重要性，我们一向庄严承诺保护使用我们的产品和服务（以下统称“有道词典服务”）之用户（以下统称“用户”或“您”）的个人信息及隐私安全。您在使用有道词典服务时，我们可能会收集和使用您的相关个人信息（或简称“个人信息”）。我们希望通过《有道词典隐私政策》（以下简称“本政策”）向您说明我们在收集和使用您相关个人信息时对应的处理规则，以及我们为您提供的访问、更正、删除和保护这些个人信息的方式，以便更好的保障您的权益。",
                content: ["本政策将帮助您了解以下内容：", "一、我们如何收集和使用您的个人信息", "二、 我们如何使用COOKIES或同类技术", "三、 我们可能分享、 转让和披露的个人信息", "四、 我们如何保留、 储存和保护您的个人信息安全", "五、 如何管理您的个人信息", "六、 第三方服务", "七、 年龄限制", "八、 通知和修订", "九、 如何联系我们", "【 特别提示】 请您在使用有道词典服务前， 仔细阅读（ 未成年人请在监护人陪同下阅读） 并了解本政策（ 特别是加粗或下划线标注的内容）， 以做出适当选择。 一旦您使用或在我们更新本政策后继续使用我们的产品或服务， 即意味着您同意本政策并同意我们按照本政策处理您的相关个人信息。", "本政策适用于有道词典服务， 如与<em>《网易邮箱帐号服务条款》</em>、<em>《有道词典服务条款》</em>、<em>《有道隐私政策》</em>同类条款之约定存在不一致的，以本政策为准。如我们提供的某一单项服务不适用本政策的，该服务中会以适当方式明示排除适用本政策。"],
                list: [{
                    title: "一、我们如何收集和使用您的个人信息",
                    desc: "我们收集您的个人信息主要是为了您和其他用户能够更容易和更满意地使用有道词典服务。而这些个人信息有助于我们实现这一目标。",
                    options: ["<strong>（一）我们将通过以下途径收集和获得您的个人信息：</strong>", "1、您提供的个人信息。 例如：", "（1）您在注册有道词典服务的帐号或使用有道词典服务时，向我们提供的个人信息；</br>（2）您通过有道词典服务向其他方提供的共享个人信息，以及您使用有道词典服务时所储存的个人信息。", "<span>请注意，如您在有道词典服务中其他用户可见的公开区域内上传或发布的个人信息中、您对其他人上传或发布的信息作出的回应中公开您的个人信息，该等个人信息可能会被他人收集并加以使用。当您发现他人不正当地收集或使用您的个人信息时，您可以通过本政策第九条【如何联系我们】约定的联系方式联络我们。</span>", "2、其他方分享的您的个人信息。亦即其他方使用有道词典服务时所提供有关您的共享个人信息。", "3、我们获取的您的个人信息。您在使用有道词典服务时，我们收集、汇总、记录的个人信息，例如日志信息、位置信息、设备信息。", "<strong>（二）我们会出于以下目的，收集和使用您以下类型的个人信息：</strong>", "1、帮助您完成注册及登录", "为便于我们为您提供完整的有道词典服务，您需要提供基本注册或登录个人信息，包括使用手机号码注册登录或提供第三方账号登录有道词典。如果您仅需使用浏览、查询、搜索等基本服务，您不需要注册成为有道词典用户及提供上述个人信息。", "在有道词典服务注册及登录过程中，如果您提供其他额外个人信息<span>（例如选择适用您的身份、学习目标、您孩子所处阶段或所属年级）</span>，将有助于我们给您提供个性化的推荐和更优的服务体验，但如果您不提供这些个人信息，并不会影响您使用有道词典服务的基本功能。同时，依照相关法律法规的要求或者特定功能及服务需要，您在使用特定功能及服务前，可能需要您提供其他个人信息（例如<span>姓名、身份证、面部特征及其他身份证明信息</span>）。如果您不提供上述个人信息，我们将不能向您提供相关的功能及服务。", "<span>如果您不再使用有道词典服务，在符合服务协议约定条件及国家相关法律法规规定的情况下，您可以通过本政策第九条【如何联系我们】约定的联系方式联络我们注销您的账号，届时我们将停止为您提供有道词典服务。</span>当您的帐号注销或被删除后，与该帐号相关的有道词典服务项下的全部服务资料和数据将被删除或匿名化处理，但法律法规另有规定的除外。", "2、向您提供商品或服务", "我们所收集和使用的个人信息是为您提供有道词典服务的必要条件，如缺少相关个人信息，我们将无法为您提供有道词典服务的核心内容：", "（1）个人信息的分享与发布：您在使用有道词典服务时、上传和/或发布个人信息以及进行相关行为时（例如：您在有道词典内输入的待翻译文字、相关学习群内发发言、提交课程作业内容及商品/服务评价），我们将收集您上传、发布或形成的个人信息，并有权展示您的昵称、头像和发布内容。在您使用有道词典拍照翻译、语音翻译、发音指导、壹句功能时，有道词典将会收集、储存您上传的图片、语音信息, 我们的相关识别程序会对这些数据进行处理分析并返回对应的文字结果。", "（2）商品或服务交付：为便于向您交付您在有道词典学习营或有道商城内购买的商品或服务，您至少需提供收货人个人身份信息、姓名、收货地址、邮政编码、收货人、联系电话、支付状态信息。如果您拒绝提供此类个人信息，我们将无法完成相关交付服务。如您通过有道词典服务为其他人订购商品或服务，您需要提供该实际订购人的前述个人信息。<span>向我们提供该实际订购人的前述个人信息之前，您需确保您已经取得其授权同意。</span>", "（3）支付结算：如您在使用我们的服务过程中产生支付结算，您可以选择有道词典关联方或与有道词典合作的第三方支付机构（包括支付宝支付、微信支付、Apple Pay、华为支付及银联、网联等支付通道，以下称“支付机构”）所提供的支付服务。支付或售后服务过程中我们可能需要将您的订单号与交易金额信息同这些支付机构共享以实现其确认您的支付指令并完成支付。", "（4）订单管理：为展示您的账户的订单信息及保障您的售后权益，有道词典会收集您在使用有道词典过程中产生的订单信息、交易和消费记录、虚拟财产信息（例如有道词典币）用于向您展示及便于您对订单进行管理。", "（5）客服与售后服务：当您与我们联系时，我们可能会保存您的通信/通话记录和内容或您留下的联系方式等个人信息，以便与您联系或帮助您解决问题，或记录相关问题的处理方案及结果。为确认交易状态及为您提供售后与争议解决服务，我们会通过您基于交易所选择的交易对象、支付机构、物流公司等收集与交易进度相关的您的交易、支付、物流信息，或将您的交易信息共享给上述服务提供者。", "（6）我们在您使用服务过程中可能收集的个人信息", "为向您提供更契合您需求的页面展示和推荐个性化内容、进行用户画像、了解产品适配性、识别账号异常状态，我们可能会收集关于您使用的服务以及使用方式的个人信息并将这些个人信息进行关联，这些个人信息包括：", "日志信息：当您使用我们的服务时，我们可能会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。例如您的登录账号、搜索查询内容、IP地址、浏览器的类型、电信运营商、网络环境、使用的语言、访问日期和时间及您访问的网页浏览记录、Push打开记录、停留时长、刷新记录、发布记录、关注、订阅、收藏及分享。", "设备信息：我们可能会根据您在软件安装及使用中授予的具体权限，接收并记录您所使用的设备相关信息（<span>例如IMEI、MAC、Serial、SIM卡IMSI识别码、设备机型、操作系统及版本、客户端版本、设备分辨率、包名、设备设置、进程及软件列表、唯一设备标识符、软硬件特征信息</span>）、设备所在位置相关信息（<span>例如IP 地址、GPS位置以及能够提供相关个人信息的WLAN接入点<span>、蓝牙和基站传感器信息）。", "请注意，单独的设备信息、日志信息是无法识别特定自然人身份的个人信息。如果我们将这类非个人信息与其他个人信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除取得您授权或法律法规另有规定外，我们会将该类个人信息做匿名化、去标识化处理。", "（7）我们通过间接方式收集到的您的个人信息：", "<span>我们可能从管理关联方、第三方合作伙伴获取您授权共享的相关个人信息。例如，我们可能从第三方获取您授权共享的账户信息（头像、昵称、登录时间）并在您同意本政策后将您的第三方账户与您的有道词典服务账户绑定，使您可以通过第三方账户直接登录并使用我们的产品与/或服务。</span>我们将在符合相关法律法规规定，并依据与关联方或第三方合作伙伴的约定、确信其提供的个人信息来源合法的前提下，收集并使用您的这些个人信息。", "（8）基于上述您向我们提供的个人信息、我们可能收集的个人信息及我们通过间接方式收集到的您的个人信息，<span>我们可能会基于上述一项或几项个人信息的结合，进行推荐算法建模、程序化广告推荐算法建模、用户行为分析及用户画像，以便向您提供更契合您需求的页面展示和推荐个性化内容。</span>", "3、向您推送消息", "（1）<span>为您展示和推送商品或服务。我们可能使用您的个人信息（例如您的浏览及搜索记录、设备信息、位置信息、订单信息、您参与有道词典线上或线下活动填写问卷调查上的个人信息），用于提取您的浏览、搜索偏好、行为习惯、位置信息相关特征，并基于特征标签通过电子邮件、短信或其他方式向您发送营销信息，提供或推广我们或第三方的如下商品和服务：</span>", "我们及我们关联方的商品和服务，包括但不限于：在线教育服务、语言翻译服务、语音识别和语音合成类开发平台服务、智能硬件服务、云应用服务、电子商务、即时通讯服务、网上媒体服务、互动娱乐服务、社交网络服务、支付服务、应用软件和服务、数据管理软件和服务、网上广告服务及其他社交媒体、娱乐、资讯及通讯软件和服务；及", "第三方商品和服务，包括但不限于：互联网服务、物流服务、银行及金融服务、娱乐、书册和其他刊物服务、广告服务、积分和奖励计划，以及我们认为可能与您相关的其他商品和服务。", "<span>（2）向您发出通知。我们可能在必需时（例如当我们由于系统维护而暂停某一单项服务、变更、终止提供某一单项服务时）向您发出与服务有关的通知。</span>", "<span>如您不希望继续接收我们推送的消息，您可要求我们停止推送，例如：根据短信退订指引要求我们停止发送推广短信，或在移动端设备中进行设置，不再接收我们推送的消息；但我们依法律规定或服务协议约定发送消息的情形除外。</span>", "4、为您提供安全保障", "<span>为提高您使用我们及合作伙伴提供服务的安全性，保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或有道词典服务相关协议规则的情况，我们可能会收集、使用或整合您的账户信息、交易信息、设备信息、日志信息以及我们关联公司、合作伙伴取得您授权或依据法律共享的个人信息，来综合判断您账户及交易风险、进行身份验证、检测及防范安全事件，并依法采取必要的记录、审计、分析、处置措施。</span>", "5、改进我们的服务", "我们可能将通过有道词典服务所收集的个人信息，用于我们的其他服务。例如，在您使用有道词典服务时所收集的您的个人信息，可能在我们的其他服务中用于向您提供特定内容或向您展示与您相关的、而非普遍推送的信息；我们可能让您参与有关有道词典服务的调查，帮助我们改善现有服务或设计新服务；同时，我们可能将您的个人信息用于软件更新。", "<span>您了解并同意，在收集您的个人信息后，我们将通过技术手段对数据进行去标识化处理，去标识化处理的个人信息将无法识别您的身份，在此情况下我们有权使用已经去标识化的个人信息，对用户数据库进行分析并予以商业化的利用。</span>", "6、其他用途", "<span>请您注意，如果我们要将您的个人信息用于本政策中未载明的其他用途或额外收集未提及的其他个人信息，我们会另行事先请您同意（确认同意的方式：如勾选、弹窗、站内信、邮件、短信等方式）。一旦您同意，该等额外用途将视为本政策的一部分，该等额外个人信息也将适用本政策。</span>", "7、征得授权同意的例外", "根据相关法律法规规定，以下情形中收集您的个人信息无需征得您的授权同意：", "（1）与国家安全、国防安全有关的；", "（2）与公共安全、公共卫生、重大公共利益有关的；", "（3）与犯罪侦查、起诉、审判和判决执行等有关的；", "（4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；", "（5）所收集的个人信息是您自行向社会公众公开的；", "（6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；", "（7）根据您的要求签订合同所必需的；", "（8）用于维护有道词典服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；", "（9）为合法的新闻报道所必需的；", "（10）学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；", "（11）法律法规规定的其他情形。", "8、您理解并同意，有道词典服务可能需要您在您的设备中开启特定的访问权限（例如您的位置信息 、摄像头、相册、麦克风、通讯录及/或日历），以实现这些权限所涉及个人信息的收集和使用。当您需要关闭该功能时，大多数移动设备都会支持您的这项需求，具体方法请参考或联系您移动设备的服务商或生产商。请您注意，您开启任一权限即代表您授权我们可以收集和使用相关个人信息来为您提供对应服务，您一旦关闭任一权限即代表您取消了授权，我们将不再基于对应权限继续收集和使用相关个人信息，也无法为您提供该权限所对应的服务。但是，您关闭权限的决定不会影响此前基于您的授权所进行的个人信息收集及使用。", "9、有关个人敏感信息的提示", "<span>以上由您提供或我们收集您的个人信息中，可能包含您的个人敏感信息，例如银行账号、交易和消费记录、虚拟财产信息、系统账号、邮箱地址及其有关的密码、电话号码、网页浏览记录、位置信息。请您谨慎并留意个人敏感信息，您同意您的个人敏感信息我们可以按本政策所述的目的和方式来处理。</span>"]
                }, {
                    title: "二、我们如何使用COOKIES或同类技术",
                    desc: "",
                    options: ["<strong>（一）Cookies</strong>", "我们或我们的第三方合作伙伴可能通过COOKIES获取和使用您的个人信息，并将该等个人信息储存为日志信息。", "通过使用COOKIES，我们向您提供简单易行并富个性化的网络体验。一个COOKIES是少量的数据，它们从一个网络服务器送至您的浏览器并存在计算机硬盘上。我们使用COOKIES是为了让您可以受益。比如，为使得有道词典的登录过程更快捷，您可以选择把用户名存在一个COOKIES中。这样下次当您要登录有道词典的服务时能更加方便快捷。COOKIES能帮助我们确定您连接的页面和内容，您在有道词典特定服务上花费的时间和您所选择的有道词典服务。", "COOKIES使得我们能更好、更快地为您服务，并且使您在有道词典服务上的经历更富个性化。然而，您应该能够控制COOKIES是否以及怎样被你的浏览器接受。请查阅您的浏览器附带的文件以获得更多这方面的信息。", "我们和第三方合作伙伴可能通过COOKIES收集和使用您的个人信息，并将该等个人信息储存。", "我们使用自己的COOKIES，可能用于以下用途：", "（1）记住您的身份。例如：COOKIES有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供有关您的喜好或其他个人信息；", "（2）分析您使用我们服务的情况。我们可利用COOKIES来了解您使用有道词典服务进行什么活动、或哪些服务或服务最受欢迎；", "（3）广告优化。COOKIES有助于我们根据您的个人信息，向您提供与您相关的广告而非进行普遍的广告投放。", "我们为上述目的使用COOKIES的同时，可能将通过COOKIES收集的非个人身份信息汇总提供给广告商和其他伙伴，用于分析您和其他用户如何使用有道词典服务并用于广告服务。", "有道词典服务上可能会有广告商和其他合作方放置的COOKIES。这些COOKIES可能会收集与您相关的非个人身份信息，以用于分析用户如何使用该等服务、向您发送您可能感兴趣的广告，或用于评估广告服务的效果。这些第三方COOKIES收集和使用该等个人信息不受本政策约束，而是受到其自身的个人信息保护声明约束，我们不对第三方的COOKIES承担责任。", "您可以通过浏览器或用户选择机制拒绝或管理COOKIES。但请您注意，如果您停用COOKIES，我们有可能无法为您提供最佳的服务体验，某些服务也可能无法正常使用。同时，您仍然将收到广告，只是这些广告与您的相关性会降低。", "<strong>（二）<span>网站信标和像素标签</span></strong>", "除 Cookies 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的地址链接，如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好以便于我们主动改善客户服务体验。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。"]
                }, {
                    title: "三、我们可能分享、转让或披露的个人信息",
                    desc: "",
                    options: ["<strong>（一）分享</strong>", "除以下情形外，未经您同意，我们不会与我们及我们的关联方之外的任何第三方分享您的个人信息：", "<span>1、向您提供我们的服务。我们可能向合作伙伴及其他第三方分享您的个人信息，以实现您需要的核心功能或提供您需要的服务，例如：向物流服务商提供对应的订单信息；</span>", "<span>2、维护和改善我们的服务。我们可能向合作伙伴及其他第三方分享您的个人信息，以帮助我们为您提供更有针对性、更完善的服务，例如：代表我们发出电子邮件或推送通知的通讯服务提供商等；</span>", "<span>3、实现本政策第一条“我们如何收集和使用您的个人信息”部分所述目的；</span>", "<span>4、履行我们在本政策或我们与您达成的其他协议中的义务和行使我们的权利；</span>", "<span>5、向委托我们进行推广的合作伙伴等第三方共享，目的是为了使该等委托方了解推广的覆盖面和有效性。比如我们可以告知该委托方有多少人看了他们的推广信息或在看到这些信息后购买了委托方的商品，或者向他们提供不能识别个人身份的统计信息，帮助他们了解其受众或顾客。</span>", "6、在法律法规允许的范围内，为了遵守法律、维护我们及我们的关联方或合作伙伴、您或其他有道词典用户或社会公众利益、财产或安全免遭损害，比如为防止欺诈等违法活动和减少信用风险，我们可能与其他公司和组织交换个人信息。不过,这并不包括违反本政策中所作的承诺而为获利目的出售、出租、共享或以其它方式披露的个人信息。", "7、应您合法需求，协助处理您与他人的纠纷或争议；", "8、应您的监护人合法要求而提供您的个人信息；", "9、根据与您签署的服务协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供；", "10、基于学术研究而提供；", "11、基于符合法律法规的社会公共利益而提供。", "我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息。对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本政策以及其他任何相关的保密和安全措施来处理个人信息。", "<strong>（二）转让</strong>", "<span>1、随着我们业务的持续发展，我们有可能进行合并、收购、资产转让或类似的交易，而您的个人信息有可能作为此类交易的一部分而被转移。我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则,我们将要求该公司、组织重新向您征求授权同意。</span>", "2、在获得您的明确同意后，我们会向其他方转让您的个人信息。", "<strong>（三）披露</strong>", "我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才会披露您的个人信息：", "1、根据您的需求，在您明确同意的披露方式下披露您所指定的个人信息；", "</span>2、根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您个人信息的情况下，我们可能会依据所要求的个人信息类型和披露方式披露您的个人信息。在符合法律法规的前提下，当我们收到上述披露个人信息的请求时，我们会要求接收方必须出具与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的个人信息，应该在法律允许的范围内尽可能保持透明。我们对所有的请求都进行了慎重的审查，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获取的数据。</span>", "<strong> （四）分享、转让、披露个人信息时事先征得授权同意的例外</strong>", "以下情形中，分享、转让、披露您的个人信息无需事先征得您的授权同意：", "1、与国家安全、国防安全有关的；", "2、与公共安全、公共卫生、重大公共利益有关的；", "3、与犯罪侦查、起诉、审判和判决执行等司法或行政执法有关的；", "4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；", "5、您自行向社会公众公开的个人信息；", "6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。", "根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。"]
                }, {
                    title: "四、我们如何保留、储存和保护您的个人信息安全",
                    desc: "",
                    options: ["<strong>（一）我们仅在本政策所述目的所必需期间和法律法规及监管规定的时限内保存您的个人信息。如我们终止服务或运营，我们将及时停止继续收集您个人信息的活动，同时会遵守相关法律法规要求提前向您通知，并在终止服务或运营后对您的个人信息进行删除或匿名化处理，法律法规或监管部门另有规定的除外。</strong>", "<strong>（二）<span>我们在中华人民共和国境内运营中收集和产生的个人信息，存储在中国境内。以下情形除外：</span></strong>", "1、法律法规有明确规定；", "2、获得您的授权同意；", "3、您使用的产品、服务涉及跨境，我们需要向境外提供您的个人信息的。", "针对以上情形，我们会确保依据本政策及国家法律法规要求对您的个人信息提供足够的保护。", "<strong>（三）我们非常重视个人信息安全，成立了专门的安全团队，并采取一切合理可行的措施，保护您的个人信息：</strong>", "1、数据安全技术措施", "我们会采用符合业界标准的安全防护措施，包括建立合理的制度规范、安全技术来防止您的个人信息遭到未经授权的访问使用、修改,避免数据的损坏或丢失。网络服务采取了多种加密技术，例如在某些服务中，我们将利用加密技术（例如SSL）来保护您的个人信息，采取加密技术对您的个人信息进行加密保存，并通过隔离技术进行隔离。 在个人信息使用时，例如个人信息展示、个人信息关联计算，我们会采用多种数据脱敏技术增强个人信息在使用中的安全性。采用严格的数据访问权限控制和多重身份认证技术保护个人信息，避免数据被违规使用。", "2、我们为保护个人信息采取的其他安全措施", "（1）我们通过建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用。", "（2）我们通过个人信息接触者保密协议、监控和审计机制来对数据进行全面安全控制。", "（3）我们还会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识和安全意识。", "（4）<span>我们仅允许有必要知晓这些个人信息的我们及我们关联方的员工、合作伙伴访问您的个人信息，并为此设置了严格的访问权限控制和监控机制。我们同时要求可能接触到您的个人信息的所有人员履行相应的保密义务。如果未能履行这些义务，可能会被追究法律责任或被中止与我们的合作关系。</span>", "3、互联网并非绝对安全的环境，而且电子邮件、即时通讯、社交软件或其他服务软件等与其他用户的交流方式无法确定是否完全加密，我们建议您使用此类工具时请使用复杂密码，并注意保护您的个人信息安全。", "4、我们将尽力确保或担保您发送给我们的任何个人信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致个人信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。", "<strong>（四）安全事件处置</strong>", "在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们同时将及时将事件相关情况以邮件、信函、短信、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。", "<span>请您理解，由于技术的限制以及风险防范的局限，即便我们已经尽量加强安全措施，也无法始终保证个人信息百分之百的安全。您需要了解，您接入有道词典服务所用的系统和通讯网络，有可能因我们可控范围外的情况而发生问题。</span>"]
                }, {
                    title: "五、如何管理您的个人信息",
                    desc: "",
                    options: ["我们鼓励您更新和修改您的个人信息以使其更准确有效，也请您理解，您<span>更正、删除、撤回授权或停止使用有道词典服务的决定，并不影响我们此前基于您的授权而开展的个人信息处理</span>。除法律法规另有规定，当您更正、删除您的个人信息或申请注销账号时，我们可能不会立即从备份系统中更正或删除相应的个人信息，但会在备份更新时更正或删除这些个人信息。", "您可以通过以下方式来管理您的个人信息： ", "<strong>（一）访问、更正您的个人信息</strong>", "1、账户个人信息：如果您希望访问或编辑您的账户中的个人基本个人信息（如头像、昵称、个人简介、性别、年龄），您可以登录移动客户端账号通过“点击查看个人主页”执行此类操作。", "2、搜索个人信息：您可以通过点击搜索框访问或清除您的搜索历史记录。", "3、订单个人信息：您可以通过“我购买的内容”查看您的所有订单状态。", "如果您无法通过上述路径访问、更正该等个人信息，您可以通过本政策第九条【如何联系我们】约定的联系方式与我们取得联系。对于您在使用有道词典服务过程中产生的其他个人信息需要访问或更正，我们会根据本政策所列明的方式、期限及范围来响应您的请求。", "<strong>（二）<span>删除您的个人信息</span></strong>", "您可以通过“（一）访问、更正您的个人信息”中列明的方式自主删除您的部分个人信息。在部分个人信息删除时，我们可能会要求您进行身份验证，以保障个人信息安全。", "在以下情形中，您可以向我们提出删除个人信息的请求：", "1、如果我们处理个人信息的行为违反法律法规；", "2、如果我们收集、使用您的个人信息，却未征得您的授权同意；", "3、如果我们处理个人信息的行为严重违反了与您的约定；", "4、如果我们不再为您提供有道词典服务。", "若我们决定响应您的删除请求，我们还将同时尽可能通知从我们处获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。", "<strong>（三）公开与分享</strong>", "我们的多项服务可让您不仅与您的社交网络、也与使用该服务的所有用户公开分享您的相关个人信息，例如，您在有道词典服务中所上传或发布的个人信息、您对其他人上传或发布的个人信息作出的回应，通过电子邮件或在有道词典服务中不特定用户可见的公开区域内上传或公布您的个人信息，以及包括与这些个人信息有关的位置数据和日志信息。只要您不删除您所公开或共享的个人信息，有关个人信息可能一直留存在公众领域；即使您删除共享个人信息，有关个人信息仍可能由其他用户或不受我们控制的第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公众领域保存。<span>如您将个人信息通过上述渠道公开或共享，由此造成您的个人信息泄露，我们不承担责任。因此，我们提醒并请您慎重考虑是否通过上述渠道公开或共享您的个人信息。</span>", "（四）改变您授权同意的范围", "您总是可以选择是否披露个人信息。有些个人信息是使用有道词典服务所必需的，但大多数其他个人信息的提供是由您决定的。您可以通过删除个人信息、关闭设备功能等方式改变您授权我们继续收集个人信息的范围或撤回您的授权。", "<span>当您撤回授权后，我们无法继续为您提供撤回授权所对应的服务，也不再处理您相应的个人信息。但您撤回授权的决定，不会影响此前基于您的授权而开展的个人信息处理。<span>"]
                }, {
                    title: "六、第三方服务",
                    desc: "",
                    options: ["有道词典服务可能链接至第三方提供的社交媒体或其他服务（包括网站或其他服务形式）。包括：", "（1）您可利用“分享”键将某些内容分享到第三方平台，或您可利用第三方服务登录有道词典。这些功能可能会收集您的个人信息（包括您的日志个人信息），并可能在您的电脑装置COOKIES，从而正常运行上述功能；", "（2）我们通过广告或我们服务的其他方式向您提供链接，使您可以接入第三方的服务或网站；及", "（3）其他接入第三方服务的情形。", "<span>该等第三方社交媒体或其他服务由相关的第三方负责运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何个人信息），须受第三方自己的服务条款及个人信息保护声明（而非本政策）约束，您需要仔细阅读其条款。本政策仅适用于我们所收集的任何个人信息，并不适用于任何第三方提供的服务或第三方的个人信息使用规则，而我们对任何第三方使用由您提供的个人信息不承担任何责任。</span>"]
                }, {
                    title: "七、年龄限制",
                    desc: "",
                    options: ["<span>如您为未满18周岁的未成年人的，请务必让您的父母或监护人仔细阅读本政策，并在征得您的父母或监护人同意的前提下使用我们的服务或向我们提供个人信息。我们将根据国家相关法律法规的规定保护未成年人的相关个人信息。如父母或监护人发现相关未成年人个人信息为未成年人自行填写，需要进行修改或删除处理的，请随时与我们联系。</span>"]
                }, {
                    title: "八、通知和修订",
                    desc: "",
                    options: ["<span>我们可能适时修改本政策的条款，该等修改构成本政策的一部分。对于重大变更，我们会提供更显著的通知，您如果不同意该等变更，可以选择停止使用有道词典服务；如您仍然继续使用有道词典服务的，即表示同意受经修订的本政策的约束。</span>", "我们鼓励您在每次使用有道词典服务时都查阅我们的隐私政策。", "<span>我们可能在必需时（例如当我们由于系统维护而暂停某一项服务时）发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。</span>", "<span>最后，您必须对您的账号和密码信息负有保密义务。任何情况下，请小心妥善保管。</span>"]
                }, {
                    title: "九、如何联系我们",
                    desc: "",
                    options: ["北京网易有道计算机系统有限公司的联系地址为： 北京市海淀区西北旺东路10号院中关村软件园西区7号楼。 我们将按照本政策保护您的个人信息。", "我们设立了个人信息保护专职部门， 如您有关于个人信息安全的投诉和举报， 或您对本政策、 您的个人信息的相关事宜有任何问题、 意见或建议， 以及有关本政策或有道词典的隐私措施的问题， 请与我们联系。 邮箱地址：【 yddictservice @163.com】。", "一般情况下， 我们将在收到您的问题、 意见或建议之日起十五天内予以回复。"]
                }]
            },
            statement: {
                title: "网页翻译免责声明",
                desc: "网易有道提醒您:在使用网易有道翻译前，请您仔细阅读并理解本声明。您可以选择不使用网易有道翻译，但如果您使用网易有道翻译，您的使用行为将被视为对本声明全部内容的认可。",
                content: "",
                list: ["1. 任何通过使用网易有道网页翻译跳转到的第三方网页均系他人制作或提供(除网易有道官方网页外)， 您可能从该第三方网页上获得资讯及享用服务， 网易有道对其合法性概不负责， 亦不承担任何法律责任。", "2. 网易有道翻译跳转结果来自第三方网页， 不代表网易有道赞成第三方网页上的内容或立场。 任何通过使用网易有道翻译第三方网页内容或翻译其他第三方内容的翻译结果， 均不代表网易有道赞成第三方网页上的内容或立场。", "3. 您应该对使用网易有道翻译的结果自行承担风险。 网易有道不做任何形式的保证: 不保证第三方内容结果的安全性、 正确性、 及时性、 合法性。 因网络状况、 通讯线路、 第三方网站等任何原因而导致您不能正常使用网易有道服务， 网易有道不承担任何法律责任。", "4. 鉴于网易有道翻译根据您键入的网址跳转到第三方网页， 除网易有道注明之免责条款外， 其他一切因使用网易有道翻译在第三方网页而可能遭致的意外、 疏忽、 侵权及 其造成的损失(包括因第三方网站的下载内容而感染电脑病毒)， 网易有道对其概不负责， 亦不承担任何法律责任。", "5. 任何单位或个人认为通过网易有道翻译跳转到的第三方网页内容可能涉嫌侵犯其信息网络传播权， 危害网络安全， 违法犯罪等， 应该及时向网易有道投诉渠道提出投诉反馈。 网易有道在收到投诉反馈后， 将会依法尽快屏蔽相关链接。"]
            }
        }
            , U = {
            name: "ClauseContainer",
            props: {
                clause: Array
            },
            data: function() {
                return {
                    data: {},
                    type: ""
                }
            },
            watch: {
                clause: function() {
                    this.init()
                }
            },
            mounted: function() {
                this.init()
            },
            methods: {
                init: function() {
                    var t = this.clause[0];
                    this.type = t,
                        this.data = L[t]
                }
            }
        }
            , P = U
            , E = (a("ec3b"),
            a("8f8a"),
            Object(c["a"])(P, k, I, !1, null, "75f0f9ba", null))
            , x = E.exports
            , V = {
            name: "Clause",
            data: function() {
                return {
                    clause: ["search"],
                    options: [{
                        value: "search",
                        label: "服务条款"
                    }, {
                        value: "policy",
                        label: "隐私政策"
                    }, {
                        value: "statement",
                        label: "免责声明"
                    }]
                }
            },
            mounted: function() {
                window._rlog.push(["_trackEvent", "terms_visit"])
            },
            watch: {
                $route: function(t, e) {
                    if (void 0 != t.query.clause) {
                        var a = [];
                        a.push(t.query.clause),
                            this.clause = a
                    }
                }
            },
            beforeRouteEnter: function(t, e, a) {
                if (void 0 != t.query.clause) {
                    var n = [];
                    n.push(t.query.clause),
                        a(function(t) {
                            t.clause = n
                        })
                }
                a()
            },
            components: {
                YDTabBar: w,
                YDFYFooterBar: S,
                ClauseContainer: x
            }
        }
            , M = V
            , $ = (a("fe6b"),
            a("73d9"),
            Object(c["a"])(M, d, h, !1, null, "1bf5ea96", null))
            , H = $.exports
            , j = function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("div", {
                attrs: {
                    id: "oneKeyTrans"
                }
            }, [a("y-d-f-y-tab-bar"), t._m(0), t._m(1), a("footer", [a("y-d-f-y-footer-bar")], 1)], 1)
        }
            , N = [function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("div", {
                staticClass: "banner"
            }, [a("img", {
                attrs: {
                    src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/banner.png"
                }
            })])
        }
            , function() {
                var t = this
                    , e = t.$createElement
                    , a = t._self._c || e;
                return a("div", {
                    staticClass: "container"
                }, [a("p", [t._v("如何使用？")]), a("span", [t._v("第一步：收藏本网站到浏览器书签，将书签调整到方便的位置")]), a("em", [t._v("Windows 使用快捷键 Ctrl+D，Mac使用快捷键 Command+D 收藏书签，或者将下方按钮拖动到浏览器书签栏")]), a("a", {
                    staticClass: "collect",
                    attrs: {
                        href: "javascript: void((function() {var element = document.createElement('script');element.id = 'outfox_seed_js';element.charset = 'utf-8',element.setAttribute('src', 'http://fanyi.youdao.com/web2/seed.js?' + Date.parse(new Date()));document.body.appendChild(element);})())"
                    }
                }, [a("span", [t._v("有道网页翻译2.0")])]), a("em", {
                    staticStyle: {
                        "font-weight": "400"
                    }
                }, [t._v("注：使用快捷键 Ctrl+Shift+B，可显示浏览器书签栏")]), a("span", {
                    staticStyle: {
                        "font-weight": "500",
                        margin: "0 0 26px 120px"
                    }
                }, [t._v("第二步：浏览英文网页时，点击浏览器书签栏中的“有道网页翻译”即可。")]), a("div", {
                    staticClass: "example"
                }, [a("div", {
                    staticClass: "windows"
                }, [a("img", {
                    attrs: {
                        src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/windows_pic1.png",
                        alt: "",
                        srcset: ""
                    }
                }), a("i", [t._v("windows")])]), a("div", {
                    staticClass: "mac"
                }, [a("img", {
                    attrs: {
                        src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/windows_pic.png",
                        alt: "",
                        srcset: ""
                    }
                }), a("i", [t._v("mac")])])])])
            }
        ]
            , z = function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("div", {
                attrs: {
                    id: "tabBar"
                }
            }, [a("div", {
                staticClass: "bar"
            }, [a("div", {
                staticClass: "logo"
            }, [a("a", {
                attrs: {
                    href: "http://fanyi.youdao.com/"
                }
            }, [a("img", {
                attrs: {
                    src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/YDFYlogo.png",
                    alt: "",
                    srcset: ""
                }
            }), t.webPageTrans ? t._e() : a("h5", [t._v("免费、即时的多语种在线翻译")])])]), t.webPageTrans ? a("search", {
                ref: "reSearch",
                attrs: {
                    userTurnUrl: t.userTurnUrl
                }
            }) : t._e(), a("div", {
                staticClass: "other_products"
            }, [t._m(0), a("span", {
                on: {
                    mouseover: t.hoverMoreIn,
                    mouseout: t.hoverMoreOut
                }
            }, [t._v("\n        更多\n      ")]), a("span", {
                class: [t.showMoreList ? "rotate triangle" : "rotate_restore triangle"]
            })]), t.showMoreList ? a("div", {
                staticClass: "more",
                on: {
                    mouseenter: t.hoverMoreListIn,
                    mouseleave: t.hoverMoreListOut
                }
            }, [a("router-link", {
                attrs: {
                    tag: "a",
                    to: {
                        path: "/clause",
                        query: {
                            clause: "statement"
                        }
                    },
                    target: "_blank"
                }
            }, [t._v("免责声明 ")]), a("router-link", {
                attrs: {
                    tag: "a",
                    to: {
                        path: "/complain?complainUrl=" + this.userInputUrl
                    },
                    target: "_blank"
                }
            }, [t._v("网站投诉 ")])], 1) : t._e()], 1)])
        }
            , W = [function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("a", {
                attrs: {
                    href: "https://cidian.youdao.com/mobile.html",
                    target: "_blank"
                }
            }, [a("img", {
                attrs: {
                    src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/web_icon_download.png"
                }
            }), t._v("\n        下载有道词典\n      ")])
        }
        ]
            , B = (a("8e6e"),
            a("ac6a"),
            a("456d"),
            a("bd86"))
            , D = function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("div", {
                attrs: {
                    id: "search"
                }
            }, [a("div", {
                class: [t.inputting ? "search_trans_inputting" : "search_trans"],
                nativeOn: {
                    submit: function(t) {
                        t.preventDefault()
                    }
                }
            }, ["自动检测语言" === t.transLanguages ? a("div", {
                staticClass: "self_motion_trans",
                on: {
                    click: t.chooseLanguage,
                    mouseleave: t.hoverLanguageListOut
                }
            }, [t._v("\n      " + t._s(t.transLanguages) + "\n      "), a("span", {
                class: [t.showChooseLanguage ? "rotate triangle" : "rotate_restore triangle"]
            })]) : t._e(), "自动检测语言" !== t.transLanguages ? a("div", {
                staticClass: "trans_languages",
                on: {
                    click: t.chooseLanguage,
                    mouseover: t.hoverIn,
                    mouseout: t.hoverOut
                }
            }, [a("p", [t._v(t._s(t.transLanguages.from))]), a("img", {
                directives: [{
                    name: "show",
                    rawName: "v-show",
                    value: !t.languagesHoverStatus,
                    expression: "!languagesHoverStatus"
                }],
                attrs: {
                    src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/iconblack.png",
                    alt: ""
                }
            }), a("img", {
                directives: [{
                    name: "show",
                    rawName: "v-show",
                    value: t.languagesHoverStatus,
                    expression: "languagesHoverStatus"
                }],
                attrs: {
                    src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/iconred.png",
                    alt: ""
                }
            }), a("p", [t._v(t._s(t.transLanguages.to))]), a("span", {
                staticClass: "triangle"
            })]) : t._e(), a("input", {
                directives: [{
                    name: "model",
                    rawName: "v-model",
                    value: t.searchUrl,
                    expression: "searchUrl"
                }],
                ref: "searchUrl",
                staticClass: "search_url",
                attrs: {
                    placeholder: "请输入网址"
                },
                domProps: {
                    value: t.searchUrl
                },
                on: {
                    keydown: function(e) {
                        return e.type.indexOf("key") || 13 === e.keyCode ? t.trans() : null
                    },
                    focus: function(e) {
                        return t.searchTextInputting()
                    },
                    blur: t.blurInputting,
                    input: function(e) {
                        e.target.composing || (t.searchUrl = e.target.value)
                    }
                }
            })]), a("button", {
                staticClass: "search",
                on: {
                    click: t.trans
                }
            }), a("div", {
                staticClass: "options"
            }, t._l(t.options, function(e, n) {
                return a("p", {
                    key: n,
                    class: [e.selected ? "selected" : ""],
                    on: {
                        click: function(e) {
                            return t.chooseTransWay(n)
                        }
                    }
                }, [t._v(t._s(e.text))])
            }), 0), t.showChooseLanguage ? a("ul", {
                staticClass: "language_options",
                on: {
                    mouseleave: t.hoverLanguageListOut,
                    mouseenter: t.hoverLanguageListIn
                }
            }, [a("li", {
                on: {
                    click: function(e) {
                        return t.changeTargetLanguage(-1)
                    }
                }
            }, [a("p", {
                class: {
                    selected: t.automaticCheck
                }
            }, [t._v("自动检测语言")])]), t._l(t.languageOptions, function(e, n) {
                return a("li", {
                    key: n,
                    on: {
                        click: function(e) {
                            return t.changeTargetLanguage(n)
                        }
                    }
                }, [a("p", {
                    class: [e.selected ? "selected" : ""]
                }, [t._v("\n        " + t._s(e.from) + "\n        "), e.selected ? t._e() : a("img", {
                    staticClass: "arrows",
                    attrs: {
                        src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/iconblack.png"
                    }
                }), e.selected ? a("img", {
                    staticClass: "arrows",
                    attrs: {
                        src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/icon_white.png"
                    }
                }) : t._e(), t._v("\n        " + t._s(e.to) + "\n      ")])])
            })], 2) : t._e()])
        }
            , K = []
            , F = a("7618")
            , A = (a("28a5"),
                a("3b2b"),
                function(t) {
                    var e = !1
                        , a = /\b((?:[a-z][\w\-]+:(?:\/{1,3}|[a-z0-9%])|www\d{0,3}[.]|[a-z0-9.\-]+[.][a-z]{2,4}\/)(?:[^\s()<>]|\((?:[^\s()<>]|(?:\([^\s()<>]+\)))*\))+(?:\((?:[^\s()<>]|(?:\([^\s()<>]+\)))*\)|[^\s`!()\[\]{};:'".,<>?«»“”‘’]))/i;
                    return e = !!a.exec(t.toLowerCase()),
                        e
                }
        )
            , q = function(t) {
            var e = new RegExp("(\\?|#|&)" + t + "=([^&#]*)(&|#|$)")
                , a = location.href.match(e);
            return decodeURIComponent(a ? a[2] : "")
        }
            , R = {
            name: "Search",
            props: ["userTurnUrl"],
            data: function() {
                return {
                    searchUrl: "",
                    transLanguages: "自动检测语言",
                    languagesHoverStatus: !1,
                    showChooseLanguage: !1,
                    showChooseLanguageStatus: !1,
                    showLanuageListTimer: "",
                    automaticCheck: !1,
                    transType: 1,
                    inputting: !1,
                    transTo: "auto",
                    transFrom: "auto",
                    options: [{
                        val: 1,
                        text: "译文",
                        selected: !0
                    }, {
                        val: 2,
                        text: "原文+译文",
                        selected: !1
                    }, {
                        val: 0,
                        text: "原文",
                        selected: !1
                    }],
                    languageOptions: [{
                        from: "中文",
                        fromVal: "zh-CHS",
                        to: "英语",
                        label: "中文 >> 英语",
                        toVal: "en",
                        selected: !1
                    }, {
                        from: "英语",
                        fromVal: "en",
                        to: "中文",
                        toVal: "zh-CHS",
                        selected: !1
                    }, {
                        from: "中文",
                        fromVal: "zh-CHS",
                        to: "日语",
                        toVal: "ja",
                        selected: !1
                    }, {
                        from: "日语",
                        fromVal: "ja",
                        to: "中文",
                        toVal: "zh-CHS",
                        selected: !1
                    }, {
                        from: "中文",
                        fromVal: "zh-CHS",
                        to: "韩语",
                        toVal: "ko",
                        selected: !1
                    }, {
                        from: "韩语",
                        fromVal: "ko",
                        to: "中文",
                        toVal: "zh-CHS",
                        selected: !1
                    }, {
                        from: "中文",
                        fromVal: "zh-CHS",
                        to: "法语",
                        toVal: "fr",
                        selected: !1
                    }, {
                        from: "法语",
                        fromVal: "fr",
                        to: "中文",
                        toVal: "zh-CHS",
                        selected: !1
                    }, {
                        from: "中文",
                        fromVal: "zh-CHS",
                        to: "德语",
                        toVal: "de",
                        selected: !1
                    }, {
                        from: "德语",
                        fromVal: "de",
                        to: "中文",
                        toVal: "zh-CHS",
                        selected: !1
                    }, {
                        from: "中文",
                        fromVal: "zh-CHS",
                        to: "俄语",
                        toVal: "ru",
                        selected: !1
                    }, {
                        from: "俄语",
                        fromVal: "ru",
                        to: "中文",
                        toVal: "zh-CHS",
                        selected: !1
                    }, {
                        from: "中文",
                        fromVal: "zh-CHS",
                        to: "西班牙语",
                        toVal: "es",
                        selected: !1
                    }, {
                        from: "西班牙语",
                        fromVal: "es",
                        to: "中文",
                        toVal: "zh-CHS",
                        selected: !1
                    }, {
                        from: "中文",
                        fromVal: "zh-CHS",
                        to: "葡萄牙语",
                        toVal: "pt",
                        selected: !1
                    }, {
                        from: "葡萄牙语",
                        fromVal: "pt",
                        to: "中文",
                        toVal: "zh-CHS",
                        selected: !1
                    }, {
                        from: "中文",
                        fromVal: "zh-CHS",
                        to: "意大利语",
                        toVal: "it",
                        selected: !1
                    }, {
                        from: "意大利语",
                        fromVal: "it",
                        to: "中文",
                        toVal: "zh-CHS",
                        selected: !1
                    }, {
                        from: "中文",
                        fromVal: "zh-CHS",
                        to: "越南语",
                        toVal: "vi",
                        selected: !1
                    }, {
                        from: "越南语",
                        fromVal: "vi",
                        to: "中文",
                        toVal: "zh-CHS",
                        selected: !1
                    }, {
                        from: "中文",
                        fromVal: "zh-CHS",
                        to: "印尼语",
                        toVal: "id",
                        selected: !1
                    }, {
                        from: "印尼语",
                        fromVal: "id",
                        to: "中文",
                        toVal: "zh-CHS",
                        selected: !1
                    }, {
                        from: "中文",
                        fromVal: "zh-CHS",
                        to: "阿拉伯语",
                        toVal: "ar",
                        selected: !1
                    }, {
                        from: "阿拉伯语",
                        fromVal: "ar",
                        to: "中文",
                        toVal: "zh-CHS",
                        selected: !1
                    }]
                }
            },
            watch: {
                searchUrl: function() {
                    this.inputting = !0
                },
                $route: function() {
                    var t = q("url");
                    this.searchUrl = "" != t && void 0 != t && null != t ? t : ""
                },
                userTurnUrl: function(t) {
                    this.searchUrl = t
                }
            },
            mounted: function() {
                var t = this
                    , e = this
                    , a = q("url")
                    , n = "" != q("from") ? q("from") : this.transFrom
                    , s = "" != q("type") ? q("type") : this.transType
                    , o = "" != q("to") ? q("to") : this.transTo;
                this.transType = s;
                var r = this.options.concat();
                if (r.forEach(function(e, a) {
                    e.selected = !1,
                    e.val == s && (r[a].selected = !0,
                        t.transType = r[a].val,
                        t.options = r)
                }),
                "undefined" != typeof window.postMessage) {
                    var i = function(t) {
                        var a = "string" == typeof t.data && e.isJsonString(t.data) ? JSON.parse(t.data) : t.data;
                        a.TransFrom && a.TransTo && "auto" == e.transFrom && "auto" == e.transTo && (e.transFrom = a.TransFrom,
                            e.transTo = a.TransTo,
                            e.languageOptions.forEach(function(t, n) {
                                t.fromVal == a.TransFrom && t.toVal == a.TransTo && (e.transLanguages = e.languageOptions[n])
                            }))
                    };
                    window.addEventListener ? window.addEventListener("message", i, !1) : window.attachEvent && window.attachEvent("onmessage", i)
                }
                var c = this.languageOptions;
                if ("" != o && void 0 != o && null != o && "" != n && void 0 != n && null != n) {
                    for (var l = 0; l < c.length; l++)
                        if (c[l].fromVal === n && c[l].toVal === o) {
                            this.transLanguages = c[l];
                            break
                        }
                } else
                    this.automaticCheck = !0;
                "" != a && void 0 != a && null != a && (this.searchUrl = a)
            },
            methods: {
                isJsonString: function(t) {
                    try {
                        if ("object" == Object(F["a"])(JSON.parse(t)))
                            return !0
                    } catch (e) {
                        return !1
                    }
                },
                chooseTransWay: function(t) {
                    var e = this.options.concat();
                    e.forEach(function(t) {
                        t.selected = !1
                    }),
                        e[t].selected = !0,
                        this.transType = e[t].val,
                        this.options = e,
                        this.trans()
                },
                hoverLanguageListIn: function() {
                    window.clearInterval(this.showLanuageListTimer)
                },
                hoverLanguageListOut: function() {
                    var t = this;
                    this.showLanuageListTimer = setTimeout(function() {
                        t.showChooseLanguage = !1
                    }, 500)
                },
                chooseLanguage: function() {
                    this.showChooseLanguage = !this.showChooseLanguage
                },
                changeTargetLanguage: function(t) {
                    var e = this.languageOptions.concat();
                    if (e.forEach(function(t) {
                        t.selected = !1
                    }),
                        this.showChooseLanguage = !1,
                    -1 == t)
                        return this.transTo = "auto",
                            this.transFrom = "auto",
                            this.transLanguages = "自动检测语言",
                            void (this.automaticCheck = !0);
                    this.automaticCheck = !1,
                        e[t].selected = !0,
                        this.transTo = e[t].toVal,
                        this.transFrom = e[t].fromVal,
                        this.transLanguages = e[t],
                        this.languageOptions = e,
                        this.trans()
                },
                trans: function() {
                    if (this.searchUrl = this.searchUrl.trim(),
                    "" != this.searchUrl) {
                        var t = this.transFrom
                            , e = this.transTo
                            , a = this.transType;
                        window.location.href = "http://webtrans.yodao.com/webTransPc/index.html?from=".concat(t, "&to=").concat(e, "&type=").concat(a, "&url=").concat(encodeURIComponent(this.searchUrl))
                    }
                },
                searchTextInputting: function() {
                    this.showChooseLanguage = !1,
                        this.inputting = !0,
                        this.$refs.searchUrl.select()
                },
                blurInputting: function() {
                    this.inputting = !1
                },
                hoverIn: function() {
                    this.languagesHoverStatus = !0
                },
                hoverOut: function() {
                    this.languagesHoverStatus = !1
                }
            }
        }
            , Y = R
            , Q = (a("a681"),
            Object(c["a"])(Y, D, K, !1, null, "30665dba", null))
            , J = Q.exports
            , Z = (a("5118"),
            a("2f62"));
        function G(t, e) {
            var a = Object.keys(t);
            return Object.getOwnPropertySymbols && a.push.apply(a, Object.getOwnPropertySymbols(t)),
            e && (a = a.filter(function(e) {
                return Object.getOwnPropertyDescriptor(t, e).enumerable
            })),
                a
        }
        function X(t) {
            for (var e = 1; e < arguments.length; e++)
                if (e % 2) {
                    var a = null != arguments[e] ? arguments[e] : {};
                    G(a, !0).forEach(function(e) {
                        Object(B["a"])(t, e, a[e])
                    })
                } else
                    Object.getOwnPropertyDescriptors ? Object.defineProperties(t, Object.getOwnPropertyDescriptors(arguments[e])) : G(a).forEach(function(a) {
                        Object.defineProperty(t, a, Object.getOwnPropertyDescriptor(arguments[e], a))
                    });
            return t
        }
        var tt = {
            name: "TabBar",
            props: ["webPageTrans", "userTurnUrl"],
            data: function() {
                return {
                    value: "",
                    liveMoreTimer: "",
                    showMoreList: !1,
                    liveMoreListTimer: ""
                }
            },
            computed: X({}, Object(Z["b"])(["userInputUrl"])),
            methods: {
                hoverMoreIn: function() {
                    this.showMoreList = !0,
                        window.clearTimeout(this.liveMoreTimer),
                        window.clearTimeout(this.liveMoreListTimer)
                },
                hoverMoreOut: function() {
                    var t = this;
                    this.liveMoreTimer = setTimeout(function() {
                        t.showMoreList = !1
                    }, 800)
                },
                hoverMoreListIn: function() {
                    window.clearTimeout(this.liveMoreTimer),
                        window.clearTimeout(this.liveMoreListTimer)
                },
                hoverMoreListOut: function() {
                    var t = this;
                    this.liveMoreListTimer = setTimeout(function() {
                        t.showMoreList = !1
                    }, 800)
                },
                reSearch: function() {
                    this.$refs.reSearch.trans()
                }
            },
            components: {
                Search: J
            }
        }
            , et = tt
            , at = (a("8b3d"),
            Object(c["a"])(et, z, W, !1, null, "7cb2da45", null))
            , nt = at.exports
            , st = {
            name: "oneKeyTrans",
            data: function() {
                return {}
            },
            components: {
                YDFYTabBar: nt,
                YDFYFooterBar: S
            }
        }
            , ot = st
            , rt = (a("acbd"),
            Object(c["a"])(ot, j, N, !1, null, "138bdbce", null))
            , it = rt.exports
            , ct = function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("div", {
                attrs: {
                    id: "complain"
                }
            }, [a("y-d-f-y-tab-bar", {
                attrs: {
                    webPageTrans: !1
                }
            }), t.complainSuccess ? t._e() : a("div", {
                staticClass: "container"
            }, [t._m(0), a("el-input", {
                class: [t.complanUrlWrong ? "content_right" : "content_wrong"],
                attrs: {
                    placeholder: "请输入内容"
                },
                model: {
                    value: t.complanUrl,
                    callback: function(e) {
                        t.complanUrl = e
                    },
                    expression: "complanUrl"
                }
            }), t._m(1), a("ul", t._l(t.complanReasonOptions, function(e, n) {
                return a("li", {
                    key: n,
                    staticClass: "complan_reason"
                }, [a("el-radio", {
                    attrs: {
                        label: e
                    },
                    model: {
                        value: t.complanReason,
                        callback: function(e) {
                            t.complanReason = e
                        },
                        expression: "complanReason"
                    }
                }, [t._v(t._s(e))])], 1)
            }), 0), t._m(2), a("el-input", {
                attrs: {
                    type: "textarea",
                    placeholder: "请输入投诉原因",
                    maxlength: "200",
                    "show-word-limit": ""
                },
                model: {
                    value: t.complanDesc,
                    callback: function(e) {
                        t.complanDesc = e
                    },
                    expression: "complanDesc"
                }
            }), t._m(3), a("div", {
                staticClass: "contact"
            }, t._l(t.contactOptions, function(e, n) {
                return a("div", {
                    key: n,
                    staticClass: "contact_way",
                    on: {
                        click: function(e) {
                            return t.changeContactWay(n)
                        }
                    }
                }, [e.selected ? t._e() : a("img", {
                    attrs: {
                        src: e.img
                    }
                }), e.selected ? a("img", {
                    attrs: {
                        src: e.selectImg
                    }
                }) : t._e()])
            }), 0), a("el-input", {
                ref: "contact",
                class: [t.contactWrong ? "content_right" : "content_wrong"],
                attrs: {
                    placeholder: "请输入你的联系方式"
                },
                model: {
                    value: t.contact,
                    callback: function(e) {
                        t.contact = e
                    },
                    expression: "contact"
                }
            }), a("button", {
                class: [t.canSubmit ? "can_submit" : "no_submit"],
                on: {
                    click: t.submit
                }
            }, [t._v("提交")])], 1), t.complainSuccess ? a("div", {
                staticClass: "complain_success"
            }, [a("img", {
                attrs: {
                    src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/Web_icon_succeed.png",
                    alt: ""
                }
            }), a("h5", [t._v("投诉成功")]), a("p", [t._v("我们将尽快核实投诉信息，核实后将对该网站采取屏蔽")]), a("p", [t._v("措施，感谢您的反馈！"), a("span", [t._v(t._s(t.timeTurn) + "秒后跳转到有道翻译首页…")])])]) : t._e(), a("footer", [a("y-d-f-y-footer-bar")], 1), t._m(4)], 1)
        }
            , lt = [function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("h5", [t._v("投诉网址 "), a("span", {
                staticClass: "segmentation"
            }), a("span", {
                staticClass: "required"
            }, [t._v("必填")])])
        }
            , function() {
                var t = this
                    , e = t.$createElement
                    , a = t._self._c || e;
                return a("p", [t._v("请选择投诉原因"), a("span", {
                    staticClass: "segmentation"
                }), a("span", {
                    staticClass: "required"
                }, [t._v("必填")])])
            }
            , function() {
                var t = this
                    , e = t.$createElement
                    , a = t._self._c || e;
                return a("p", {
                    staticClass: "question_desc"
                }, [t._v("描述"), a("span", {
                    staticClass: "segmentation"
                }), a("span", {
                    staticClass: "optional"
                }, [t._v("选填")])])
            }
            , function() {
                var t = this
                    , e = t.$createElement
                    , a = t._self._c || e;
                return a("p", [t._v("联系方式"), a("span", {
                    staticClass: "segmentation"
                }), a("span", {
                    staticClass: "required"
                }, [t._v("必填")])])
            }
            , function() {
                var t = this
                    , e = t.$createElement
                    , a = t._self._c || e;
                return a("div", {
                    staticClass: "condition"
                }, [a("input", {
                    attrs: {
                        type: "radio"
                    }
                }), a("input", {
                    attrs: {
                        type: "radio"
                    }
                })])
            }
        ]
            , ut = a("bc3a")
            , pt = a.n(ut)
            , dt = "http://webtrans.yodao.com/server/webtrans/report"
            , ht = a("4328")
            , mt = a.n(ht);
        pt.a.defaults.withCredentials = !0;
        var ft = function(t) {
            return new Promise(function(e, a) {
                    pt.a.post(dt, mt.a.stringify(t), {
                        headers: {
                            "Content-Type": "application/x-www-form-urlencoded"
                        }
                    }).then(function(t) {
                        e(t.data)
                    }).catch(function(t) {
                        a(t)
                    })
                }
            )
        }
            , gt = {
            name: "Complain",
            data: function() {
                return {
                    complanUrl: "",
                    complanUrlWrong: !0,
                    complainSuccess: !1,
                    contactWrong: !0,
                    complanReason: "",
                    complanDesc: "",
                    contact: "",
                    canSubmit: !1,
                    timeTurn: 5,
                    contactWay: "手机",
                    contactOptions: [{
                        val: "手机",
                        selected: !0,
                        img: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/login_ic_iphone.png",
                        selectImg: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/login_ic_phoneSelected.png"
                    }, {
                        val: "微信",
                        selected: !1,
                        img: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/login_ic_wech.png",
                        selectImg: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/login_ic_wechatSelected.png"
                    }, {
                        val: "微博",
                        selected: !1,
                        img: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/login_ic_weibo.png",
                        selectImg: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/login_ic_weiboSelected.png"
                    }, {
                        val: "QQ",
                        selected: !1,
                        img: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/login_ic_qq.png",
                        selectImg: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/login_ic_qqSelected.png"
                    }, {
                        val: "邮箱",
                        selected: !1,
                        img: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/login_ic_youxiang.png",
                        selectImg: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/login_ic_youxiangSelected.png"
                    }],
                    complanReasonOptions: ["网页包含欺诈信息", "网页包含色情信息", "网页包含不实信息", "网页包含违法犯罪信息", "其他"]
                }
            },
            mounted: function() {
                this.complanUrl = this.$store.state.searchUrl
            },
            watch: {
                complanUrl: function() {
                    this.complanUrlWrong = !0,
                        this.checkCanSubmit()
                },
                complanReason: function() {
                    this.checkCanSubmit()
                },
                contact: function() {
                    this.contactWrong = !0,
                        this.checkCanSubmit()
                },
                complainSuccess: function(t) {
                    var e = this;
                    if (t)
                        setInterval(function() {
                            0 != e.timeTurn ? e.timeTurn = e.timeTurn - 1 : window.location.href = "http://fanyi.youdao.com/"
                        }, 1e3)
                }
            },
            methods: {
                submit: function() {
                    var t = this;
                    if (this.canSubmit) {
                        if ("手机" == this.contactWay && !this.checkPhone(this.contact))
                            return !1;
                        if ("邮箱" == this.contactWay && !this.checkEmail(this.contact))
                            return !1;
                        if ("QQ" == this.contactWay && !this.checkQQ(this.contact))
                            return !1;
                        if ("微信" == this.contactWay && !this.checkWechat(this.contact))
                            return !1;
                        if (!A(this.complanUrl))
                            return this.$message.error("网址格式有误，请输入正确网址"),
                                !1;
                        window._rlog.push(["_trackEvent", "webtranslation_complaint_submit"]);
                        var e = {
                            reportUrl: encodeURI(this.complanUrl),
                            reportContent: this.complanReason,
                            reportDetails: this.complanDesc,
                            contact: "".concat(this.contactWay, ":").concat(this.contact)
                        };
                        ft(e).then(function(e) {
                            t.complainSuccess = !0
                        })
                    }
                },
                changeContactWay: function(t) {
                    var e = this.contactOptions.concat();
                    e.forEach(function(t, e) {
                        t.selected = !1
                    }),
                        e[t].selected = !0,
                        this.contactOptions = e,
                        this.contactWay = e[t].val
                },
                checkPhone: function(t) {
                    return !!/^1[3456789]\d{9}$/.test(t) || (this.$message.error("手机号码有误，请重填"),
                        this.contactWrong = !1,
                        !1)
                },
                checkEmail: function(t) {
                    var e = /^([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+\.[a-zA-Z]{2,3}$/;
                    return !!e.test(t) || (this.contactWrong = !1,
                        this.$message.error("邮箱格式不正确！"),
                        !1)
                },
                checkWechat: function(t) {
                    return !!/^[a-zA-Z]([-_a-zA-Z0-9]{5,19})+$/.test(t) || (this.$message.error("微信号错误，请重填"),
                        this.contactWrong = !1,
                        !1)
                },
                checkQQ: function(t) {
                    var e = /^[1-9][0-9]{4,9}$/gim;
                    return !!e.test(t) || (this.$message.error("QQ号格式错误，请重填"),
                        this.contactWrong = !1,
                        !1)
                },
                checkCanSubmit: function() {
                    "" !== this.complanUrl && "" !== this.complanReason && "" !== this.contact ? this.canSubmit = !0 : this.canSubmit = !1
                }
            },
            beforeRouteEnter: function(t, e, a) {
                void 0 != t.query.complainUrl && null != t.query.complainUrl && a(function(e) {
                    e.complanUrl = t.query.complainUrl
                }),
                    a()
            },
            components: {
                YDFYTabBar: nt,
                YDFYFooterBar: S
            }
        }
            , vt = gt
            , _t = (a("2450"),
            a("7af2"),
            Object(c["a"])(vt, ct, lt, !1, null, "3cb51989", null))
            , wt = _t.exports
            , bt = function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("div", {
                attrs: {
                    id: "webPageTrans"
                }
            }, [a("y-d-f-y-tab-bar", {
                ref: "searchBar",
                attrs: {
                    webPageTrans: t.webPageTrans,
                    userTurnUrl: t.userTurnUrl
                }
            }), t.urlNull ? a("div", {
                staticClass: "url_is_null"
            }, [a("p", [t._v("抱歉：")]), t._m(0)]) : t._e(), t.urlNo ? a("div", {
                staticClass: "url_is_no"
            }, [a("p", [t._v("很抱歉，您输入的网址不存在或当前无法访问，请稍后重试"), a("br"), t._v(t._s(t.userInputUrl))]), t._m(1)]) : t._e(), a("div", {
                directives: [{
                    name: "show",
                    rawName: "v-show",
                    value: t.isLoading,
                    expression: "isLoading"
                }],
                staticClass: "loading"
            }, [a("img", {
                attrs: {
                    src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/loading.gif",
                    alt: ""
                }
            }), a("p", [t._v("翻译中…")])]), a("div", {
                directives: [{
                    name: "show",
                    rawName: "v-show",
                    value: !t.urlNull && !t.urlNo && !t.isLoading,
                    expression: "!urlNull && !urlNo && !isLoading"
                }],
                staticClass: "iframe_contact"
            }, [a("iframe", {
                ref: "iframe",
                attrs: {
                    src: t.iframeUrl,
                    name: "iframe",
                    id: "iframe",
                    sandbox: "allow-scripts allow-same-origin allow-popups allow-forms"
                }
            })])], 1)
        }
            , yt = [function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("p", [t._v("您所输入的链接为空，请正确输入链接，或"), a("a", {
                attrs: {
                    href: "http://fanyi.youdao.com/"
                }
            }, [t._v(" 返回上一级")]), t._v("。")])
        }
            , function() {
                var t = this
                    , e = t.$createElement
                    , a = t._self._c || e;
                return a("p", [a("a", {
                    attrs: {
                        href: "https://fanyi.youdao.com/"
                    }
                }, [t._v("返回上一页")])])
            }
        ]
            , Ct = {
            name: "WebPageTrans",
            data: function() {
                return {
                    iframeUrl: "",
                    webPageTrans: !0,
                    userInputUrl: "",
                    iframeHeight: "",
                    urlNull: !0,
                    userTurnUrl: "",
                    urlNo: !1,
                    isLoading: !1
                }
            },
            mounted: function() {
                var t = this;
                if ("undefined" != typeof window.postMessage) {
                    var e = function(e) {
                        var a = "string" == typeof e.data && t.isJsonString(e.data) ? JSON.parse(e.data) : e.data;
                        if (a.goBack && (window.location.href = "http://fanyi.youdao.com/"),
                            a.newUrl) {
                            var n = decodeURIComponent(q("url"));
                            if (a.newUrl != n && "" != a.newUrl) {
                                q("from"),
                                    q("to"),
                                    q("type");
                                t.userTurnUrl = a.newUrl
                            }
                        }
                    };
                    window.addEventListener ? window.addEventListener("message", e, !1) : window.attachEvent && window.attachEvent("onmessage", e)
                }
                this.trans()
            },
            watch: {
                $route: function() {
                    this.trans()
                }
            },
            methods: {
                resetStatus: function() {
                    this.urlNull = !1,
                        this.urlNo = !1,
                        this.isLoading = !1
                },
                isJsonString: function(t) {
                    try {
                        if ("object" == Object(F["a"])(JSON.parse(t)))
                            return !0
                    } catch (e) {
                        return !1
                    }
                },
                trans: function() {
                    var t = decodeURIComponent(q("url"))
                        , e = q("from")
                        , a = q("to")
                        , n = q("type");
                    if (this.userInputUrl = t,
                    "" == t || void 0 == t)
                        this.resetStatus(),
                            this.urlNull = !0;
                    else if ("http" != t.substring(0, 4) && (t = "http://".concat(t)),
                        A(t)) {
                        this.resetStatus(),
                            this.isLoading = !0;
                        var s = "mdictweb"
                            , o = (new Date).getTime()
                            , r = "ydsecret://mdictweb.si/sign/-eV=8}L$s4$nPL00op3p]"
                            , i = t
                            , c = "".concat(s).concat(o).concat(r).concat(i)
                            , l = this.$md5(c);
                        debugger;
                        this.resetStatus();
                        var u = "http://webtrans.yodao.com/server/webtrans/tranUrl?url=".concat(encodeURIComponent(t), "&from=").concat(e, "&to=").concat(a, "&type=").concat(n, "&product=mdictweb&salt=").concat(o, "&sign=").concat(l);
                        console.info(`${new Date().toLocaleTimeString()} src/task/temp/app.d5673c1e.js:trans():构造frameURL`, u);
                        this.iframeUrl = u
                    } else
                        this.resetStatus(),
                            this.urlNo = !0
                }
            },
            beforeRouteEnter: function(t, e, a) {
                navigator.userAgent.match(/(phone|pad|pod|iPhone|iPod|ios|iPad|Android|Mobile|BlackBerry|IEMobile|MQQBrowser|JUC|Fennec|wOSBrowser|BrowserNG|WebOS|Symbian|Windows Phone)/i) && this.$router.push({
                    path: "/wap"
                }),
                    a()
            },
            components: {
                YDFYTabBar: nt
            }
        }
            , Ot = Ct
            , Tt = (a("c2c8"),
            Object(c["a"])(Ot, bt, yt, !1, null, "618e9df2", null))
            , St = Tt.exports
            , kt = function() {
            var t = this
                , e = t.$createElement
                , a = t._self._c || e;
            return a("div", {
                attrs: {
                    id: "wap"
                }
            }, [a("img", {
                staticClass: "logo",
                attrs: {
                    src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/youdaodictlogo.png",
                    alt: ""
                }
            }), a("p", [t._v("网页翻译全面升级 · 体验更快更准")]), a("img", {
                staticClass: "banner",
                attrs: {
                    src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/pic.png",
                    alt: ""
                }
            }), a("div", {
                staticClass: "open_dict"
            }, [a("div", {
                staticClass: "open",
                on: {
                    click: t.openDict
                }
            }, [t._v("一键打开")])]), t.goToBrowser ? a("div", {
                staticClass: "dialog"
            }, [a("div", {
                staticClass: "mask"
            }), a("img", {
                attrs: {
                    src: "https://shared-https.ydstatic.com/dict/market/webTransPc/images/share.png",
                    alt: ""
                }
            })]) : t._e()])
        }
            , It = []
            , Lt = (a("6762"),
            a("2fdb"),
            {
                name: "Clause",
                data: function() {
                    return {
                        goToBrowser: !1
                    }
                },
                methods: {
                    openDict: function() {
                        var t, e = navigator.userAgent, a = e.indexOf("Android") > -1 || e.indexOf("Adr") > -1, n = !!e.match(/\(i[^;]+;( U;)? CPU.+Mac OS X/);
                        a ? t = "andr" : n && (t = "ios");
                        var s = e.toLowerCase().includes("micromessenger")
                            , o = e.toLowerCase().includes("weibo");
                        if ((s || o) && (window.location.href = "https://c.youdao.com/dict/download.html"),
                        "andr" === t) {
                            window.location.href = "yddict://youdao.com";
                            var r = setTimeout(function() {
                                document.hidden || document.webkitHidden || (window.location.href = "https://c.youdao.com/dict/download.html")
                            }, 2e3)
                                , i = function() {
                                var t = document.hidden || document.webkitHidden;
                                t && clearTimeout(r)
                            };
                            document.addEventListener("visibilitychange", i, !1),
                                document.addEventListener("webkitvisibilitychange", i, !1),
                                window.addEventListener("pagehide", function() {
                                    clearTimeout(r)
                                }, !1)
                        } else
                            "ios" === t && (location.href = "https://c.youdao.com/dict/download.html")
                    }
                }
            })
            , Ut = Lt
            , Pt = (a("80c0"),
            Object(c["a"])(Ut, kt, It, !1, null, "089b6de8", null))
            , Et = Pt.exports;
        n["default"].use(p["a"]);
        var xt = new p["a"]({
            routes: [{
                path: "/",
                name: "webPageTrans",
                component: St
            }, {
                path: "/clause",
                name: "clause",
                component: H
            }, {
                path: "/oneKeyTrans",
                name: "oneKeyTrans",
                component: it
            }, {
                path: "/complain",
                name: "complain",
                component: wt
            }, {
                path: "/wap",
                name: "wap",
                component: Et
            }]
        })
            , Vt = {
            transStatus: function(t) {
                t.urlIsNull = !1,
                    t.timeOut = !1,
                    t.urlIsNo = !1,
                    t.loading = !1
            },
            transUrl: function(t, e) {
                t.transUrl = e
            },
            urlIsNull: function(t, e) {
                t.urlIsNull = e
            },
            urlIsNo: function(t, e) {
                t.urlIsNo = e
            },
            loading: function(t, e) {
                t.loading = e
            },
            timeOut: function(t, e) {
                t.timeOut = e
            },
            userInputUrl: function(t, e) {
                t.userInputUrl = e
            },
            searchUrl: function(t, e) {
                t.searchUrl = e
            }
        }
            , Mt = {
            transStatus: function(t, e) {
                t.commit("transStatus", e)
            },
            transUrl: function(t, e) {
                t.commit("transUrl", e)
            },
            urlIsNull: function(t, e) {
                t.commit("urlIsNull", e)
            },
            urlIsNo: function(t, e) {
                t.commit("urlIsNo", e)
            },
            loading: function(t, e) {
                t.commit("loading", e)
            },
            timeOut: function(t, e) {
                t.commit("timeOut", e)
            },
            userInputUrl: function(t, e) {
                t.commit("userInputUrl", e)
            },
            searchUrl: function(t, e) {
                t.commit("searchUrl", e)
            }
        };
        n["default"].use(Z["a"]);
        var $t = {
            transUrl: "",
            transStatus: "",
            urlIsNull: !0,
            urlIsNo: !1,
            loading: !1,
            searchUrl: "",
            userInputUrl: "",
            timeOut: !1
        }
            , Ht = new Z["a"].Store({
            state: $t,
            mutations: Vt,
            actions: Mt
        })
            , jt = a("5c96")
            , Nt = a.n(jt)
            , zt = a("8237")
            , Wt = a.n(zt);
        a("0fae"),
            a("4ee2");
        n["default"].prototype.$md5 = Wt.a,
            n["default"].use(Nt.a),
            n["default"].config.productionTip = !1,
            new n["default"]({
                router: xt,
                store: Ht,
                render: function(t) {
                    return t(u)
                }
            }).$mount("#app")
    },
    6239: function(t, e, a) {},
    "6a6d": function(t, e, a) {
        "use strict";
        var n = a("a878")
            , s = a.n(n);
        s.a
    },
    "6b4f": function(t, e, a) {
        "use strict";
        var n = a("6239")
            , s = a.n(n);
        s.a
    },
    "6e02": function(t, e, a) {
        "use strict";
        var n = a("b83f")
            , s = a.n(n);
        s.a
    },
    "73d9": function(t, e, a) {
        "use strict";
        var n = a("abfb")
            , s = a.n(n);
        s.a
    },
    "7af2": function(t, e, a) {
        "use strict";
        var n = a("3fce")
            , s = a.n(n);
        s.a
    },
    "80c0": function(t, e, a) {
        "use strict";
        var n = a("ab5d")
            , s = a.n(n);
        s.a
    },
    "83fa": function(t, e, a) {},
    "8b3d": function(t, e, a) {
        "use strict";
        var n = a("0ff1")
            , s = a.n(n);
        s.a
    },
    "8f8a": function(t, e, a) {
        "use strict";
        var n = a("ce68")
            , s = a.n(n);
        s.a
    },
    a681: function(t, e, a) {
        "use strict";
        var n = a("35bd")
            , s = a.n(n);
        s.a
    },
    a878: function(t, e, a) {},
    ab5d: function(t, e, a) {},
    abfb: function(t, e, a) {},
    acbd: function(t, e, a) {
        "use strict";
        var n = a("83fa")
            , s = a.n(n);
        s.a
    },
    b83f: function(t, e, a) {},
    c2c8: function(t, e, a) {
        "use strict";
        var n = a("ee6c")
            , s = a.n(n);
        s.a
    },
    ce68: function(t, e, a) {},
    ec3b: function(t, e, a) {
        "use strict";
        var n = a("00de")
            , s = a.n(n);
        s.a
    },
    ee6c: function(t, e, a) {},
    fe6b: function(t, e, a) {
        "use strict";
        var n = a("2a51")
            , s = a.n(n);
        s.a
    }
});
